export const regExpConfig = {
  email: /^\w+([-+.]\w+)*@\w+([-.]\w+)*\.\w+([-.]\w+)*$/, //Email地址
  domain: /[a-zA-Z0-9][-a-zA-Z0-9]{0,62}(\.[a-zA-Z0-9][-a-zA-Z0-9]{0,62})+\.?/, //域名
  // mobile: /^(13[0-9]|14[5|7]|15[0|1|2|3|4|5|6|7|8|9]|18[0|1|2|3|5|6|7|8|9])\d{8}$/, //手机号码
  // telephone: /^(\(\d{3,4}-)|\d{3.4}-)?\d{7,8}$/, // 电话号码("XXX-XXXXXXX"、"XXXX-XXXXXXXX"、"XXX-XXXXXXX"、"XXX-XXXXXXXX"、"XXXXXXX"和"XXXXXXXX)
  account: /^[a-zA-Z][a-zA-Z0-9_]{4,15}$/, //帐号是否合法(字母开头，允许5-16字节，允许字母数字下划线)
  pwd: /^[a-zA-Z]\w{5,17}$/, //密码(以字母开头，长度在6~18之间，只能包含字母、数字和下划线)
  strongPwd1: /^(?=.*\d)(?=.*[a-z])(?=.*[A-Z])[a-zA-Z0-9]{8,10}$/, //强密码(必须包含大小写字母和数字的组合，不能使用特殊字符，长度在 8-10 之间)
  strongPwd2: /^(?=.*\d)(?=.*[a-z])(?=.*[A-Z]).{8,10}$/, //强密码(必须包含大小写字母和数字的组合，可以使用特殊字符，长度在8-10之间)
  date: /^\d{4}-\d{1,2}-\d{1,2}/ //日期格式
}